IDENTIFICATION DIVISION.
PROGRAM-ID. Cobol08Error.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC 9(3) VALUE 100.
01 NUM2 PIC 9(3) VALUE 0.
01 RESULT PIC 9(3).

PROCEDURE DIVISION.
MAIN-LOGIC.
    DISPLAY "Starting the program."
    IF NUM2 = 0 THEN
     DISPLAY "Error: Division by zero is not allowed."
    ELSE
     COMPUTE RESULT = NUM1 / NUM2
     DISPLAY "Result: " RESULT
    END-IF
    STOP RUN.