IDENTIFICATION DIVISION.
PROGRAM-ID. Cobol01Datatype.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NUMBER          PIC 9(5) VALUE 12345.
01 WS-NAME            PIC A(10) VALUE 'JohnDoe'.
01 WS-ALPHANUMERIC    PIC X(15) VALUE 'HelloWorld123'.
01 WS-DECIMAL-NUMBER  PIC 9(5)V99 VALUE 12345.67.
01 WS-BOOLEAN         PIC 1 VALUE '1'.  *> 1 for true, 0 for false

PROCEDURE DIVISION.
    DISPLAY "Numeric Value: " WS-NUMBER.
    DISPLAY "Alphabetic Value: " WS-NAME.
    DISPLAY "Alphanumeric Value: " WS-ALPHANUMERIC.
    DISPLAY "Decimal Number: " WS-DECIMAL-NUMBER.
    DISPLAY "Boolean Value: " WS-BOOLEAN.
    STOP RUN.