IDENTIFICATION DIVISION.
PROGRAM-ID. Cobol09UserInput.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 USER-INPUT        PIC X(50).
01 DISPLAY-MESSAGE   PIC X(60) VALUE "Please enter your input: ".

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    DISPLAY DISPLAY-MESSAGE
    ACCEPT USER-INPUT
    DISPLAY "You entered: " USER-INPUT
    STOP RUN.