IDENTIFICATION DIVISION.
PROGRAM-ID. Cobol06Function.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1        PIC 9(4) VALUE 10.
01 NUM2        PIC 9(4) VALUE 20.
01 RESULT      PIC 9(4).

PROCEDURE DIVISION.
MAIN-PARA.
    PERFORM ADD-NUMBERS
    DISPLAY "The result is: " RESULT
    STOP RUN.

ADD-NUMBERS.
    COMPUTE RESULT = NUM1 + NUM2.